# Модуль с утилитами - вспомогательными скриптами для работы бота.
# Сейчас у меня нету цели объяснить подробно, что делает тот или иной модуль в шаблоне,
# думаю, это будет полный перегруз. Сейчас я хочу, чтобы у вас начал в голове формироваться
# контекст того, как вообще шаблоны работают и почему так устроены. Дальше некоторым модулям 
# я посвящу отдельные шаги, а работа других будет понятна из примеров.
# Будем использовать этот шаблон при написании ботов, либо удаляя из него лишнее, либо что-то добавляя.